<template>
   <div class="voice-message-container">
      <div class="data-and-time">{{new Date().toString()}}</div>
      <div class="photo-and-voice">
        <div class="photo">
          <img :src="value.photo" alt=""/>
        </div>
        <div class="voice" @click="play">
          <svg t="1497422232684" class="icon" style="" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="11372" xmlns:xlink="http://www.w3.org/1999/xlink" width="28" height="28"><path d="M323.598073 357.220844c-14.740726-11.897981-37.535895-10.896164-50.907437 2.253321-13.356193 13.149485-12.236696 33.472346 2.518356 45.400002 33.766035 27.301809 53.145407 66.38392 53.145408 107.202581 0 40.762379-19.422352 79.873142-53.321416 107.262956-7.864108 6.347568-11.838629 15.064091-11.83863 23.825638 0 7.687076 3.078105 15.432481 9.350972 21.588691 13.370519 13.136182 36.166711 14.136975 50.906414 2.209318 48.91813-39.568181 76.986395-96.011704 76.986395-154.886603-0.001023-58.947554-28.008914-115.390054-76.839039-154.855904h-0.001023m136.62468-105.908098c-14.032598-12.590759-36.84414-12.664438-50.951439-0.13303-14.121626 12.487406-14.165628 32.882921-0.147356 45.458331 64.101947 57.504692 99.4275 134.005017 99.4275 215.437678 0 81.286328-35.370579 157.772326-99.604532 215.380372-6.979972 6.258541-10.484795 14.46034-10.485819 22.647813 0 8.245801 3.5345 16.523325 10.616802 22.780842 14.121626 12.532431 36.917818 12.473079 50.965765-0.11768 77.768201-69.711711 120.589472-162.307619 120.589473-260.691347 0.001023-98.544387-42.777269-191.153598-120.410394-260.762979M595.670631 144.905274c-13.769608-12.797467-36.579103-13.225209-50.950415-0.927115-14.386662 12.296047-14.84408 32.646538-1.061169 45.444005 93.567026 86.999446 145.078213 201.581088 145.078213 322.641281 0 120.824833-51.599192 235.362472-145.255245 322.538951-6.684236 6.213515-10.028401 14.223956-10.028401 22.234397 0 8.438183 3.711532 16.890692 11.103896 23.208584 14.356986 12.280698 37.181831 11.838629 50.965765-0.972141 106.584504-99.194186 165.281347-229.517347 165.281347-366.996488 0.029676-137.746224-58.636468-268.128737-165.133991-367.171474m0 0z" p-id="11373" fill="#ffffff"></path></svg>
          <span>一元偷听</span>
        </div>
      </div>
      <div class="otherinfo">
        <span class="listenedNumber">{{value.listened}}个人偷听</span>
        <span class="starNumber">
          <b>
            <svg t="1497952419751" class="icon" style="width:100%;height:100%;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4013" xmlns:xlink="http://www.w3.org/1999/xlink" width="32" height="32"><path d="M832.626688 462.184448c-5.36576-9.183232-6.10304-17.16224-4.947968-24.502272 1.55648-5.193728 3.006464-10.149888 4.317184-14.761984 2.179072-5.865472 7.462912-20.414464 7.7824-39.174144 2.056192-24.674304-18.898944-44.990464-45.62944-44.990464L646.324224 338.755584c-24.674304 0-44.990464-22.888448-44.990464-47.570944 0-24.674304 32.014336-77.873152 34.717696-137.535488C640.196608 61.743104 547.34848 71.385088 547.34848 71.385088l0.04096 0.024576c0 0-14.147584 6.438912-14.147584 16.719872l0 57.188352c0 33.390592-17.547264 68.714496-39.845888 100.278272-18.890752 26.755072-43.442176 60.891136-61.374464 78.815232-18.51392 14.401536-38.641664 34.062336-63.315968 34.062336l0 329.883648c0 0 41.132032 20.56192 102.825984 20.56192l230.080512 0c3.096576 0 89.014272 3.325952 77.832192-69.763072-3.366912-22.003712 56.03328-38.682624 42.835968-78.27456C806.756352 514.351104 862.339072 513.056768 832.626688 462.184448z" fill="#539ffd" p-id="4014"></path><path d="M195.62496 334.053376l0 370.507776 143.958016 0L339.582976 334.053376 195.62496 334.053376zM267.599872 673.112064c-9.05216 0-16.384-7.33184-16.384-16.384 0-9.05216 7.33184-16.384 16.384-16.384 9.05216 0 16.384 7.33184 16.384 16.384C283.983872 665.772032 276.652032 673.112064 267.599872 673.112064z" fill="#539ffd" p-id="4015"></path></svg>
          </b>{{value.star}}</span>
      </div>
   </div>
</template>
<script>
  export default{
      props:{
        value:{
           type:Object,
           default:()=>{
              return{
                 listened:24,
                 star:20,
                 photo:"/static/images/bitmap.png"
              }
           }
        }
      },
      data(){
        return{

        }
      },
      methods:{
        play(){
          let _this = this;
          this.$vux.confirm.show({
            title:"确认支付1元偷听此条回答吗?",
            onConfirm(){
              /**
               * 此处调用支付接口
               */
              _this.$wechat.chooseWXPay({
                timestamp: 0, // 支付签名时间戳，注意微信jssdk中的所有使用timestamp字段均为小写。但最新版的支付后台生成签名使用的timeStamp字段名需大写其中的S字符
                nonceStr: '', // 支付签名随机串，不长于 32 位
                package: '', // 统一支付接口返回的prepay_id参数值，提交格式如：prepay_id=***）
                signType: '', // 签名方式，默认为'SHA1'，使用新版支付需传入'MD5'
                paySign: '', // 支付签名
                success: function (res) {
                  // 支付成功后的回调函数
                }
              })

            },
            onCancel(){
              /**
               * 回到页面，不做任何操作
               */
            }

          })
        }
      },
      components:{}
  }
</script>
<style lang="scss" scoped>
  @import "../../style/valiable.scss";
   .voice-message-container{
      color:$gray6;
      font-size:0.8rem;
      box-sizing:border-box;
      padding:0.8rem 0;
     .data-and-time{
        padding:0 0.8rem;
        font-size:0.8rem;
     }
     .photo-and-voice{
        padding:0 0.8rem;
        box-sizing:border-box;
        height:6rem;
        line-height:6rem;
        border-bottom:1px solid $borderColor;
       .photo{
          display:inline-block;
          width:4rem;
          height:4rem;
          border-radius:50%;
          vertical-align:middle;
          margin-right:1rem;
         img{
           width:100%;
           height:100%;
         }
       }
       .voice{
          display:inline-block;
          padding:0 1rem;
          border-radius:1rem;
          height:2rem;
          line-height:2rem;
          background:$theme;
          color:$white;
          .icon{
            vertical-align:middle;
          }
       }
     }
     .otherinfo{
         font-size:0.9rem;
         height:2rem;
         line-height:2rem;
         padding:0.8rem 1rem;
         .listenedNumber{
            color:$gray9;
            margin-right:2rem;
         }
         .starNumber{
            color:$gray6;
           b{
             display:inline-block;
             height:1rem;
             width:1rem;
             vertical-align:top;
           }
         }
     }
   }
</style>
